Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: No skill & competency groups yet!
th_th: ยังไม่มีกลุ่มทักษะและความสามารถ!

source: Scale
th_th: ขนาด

source: User Segmentation
th_th: การแบ่งกลุ่มผู้ใช้

source: Exclude individuals
th_th: ยกเว้นบุคคล

source: Individuals included
th_th: รวมรายบุคคล

source: Grant proxy permission
th_th: ให้สิทธิ์ตัวแทน

source: Edit proxy permission
th_th: แก้ไขสิทธิ์ตัวแทน

source: View proxy permission
th_th: ดูสิทธิ์พร็อกซี

source: Grant proxy access to:
th_th: ให้สิทธิ์การเข้าถึงในนามผู้อื่นแก่:

source: User with proxy access:
th_th: ผู้ใช้ที่มีสิทธิ์เข้าถึงในฐานะตัวแทน:

source: You haven't added any workers yet. Type in a name to add a worker.
th_th: คุณยังไม่ได้เพิ่มพนักงาน พิมพ์ชื่อเพื่อเพิ่มพนักงาน

source: Who do they need to proxy?
th_th: พวกเขาต้องใช้พร็อกซีกับใคร

source: Proxy access cannot be defined for at least one worker because they have not accepted the Data Protection Agreement (DPA).
th_th: ไม่สามารถกำหนดการเข้าถึงแบบตัวแทนให้กับพนักงานอย่างน้อยหนึ่งคนได้ เนื่องจากพวกเขายังไม่ได้ยอมรับข้อตกลงการคุ้มครองข้อมูล (DPA)

source: Proxy access was successfully granted to {{name}}!
th_th: มอบสิทธิ์การเข้าถึงพร็อกซีแก่ {{name}} สำเร็จแล้ว!

source: View list
th_th: ดูรายการ

source: View proxy access list
th_th: ดูรายการการเข้าถึงพร็อกซี

source: Granted by
th_th: อนุญาตโดย

source: List of workers
th_th: รายชื่อพนักงาน

source: Historical Performance Rating Upload
th_th: อัปโหลดคะแนนผลการปฏิบัติงานในอดีต

source: Performance Review Settings
th_th: การตั้งค่าการประเมินผลการปฏิบัติงาน

source: Performance Review Template
th_th: แม่แบบการประเมินผลการปฏิบัติงาน

source: Search in Workbench
th_th: ค้นหาใน Workbench

source: Workers & Professional Roles
th_th: แรงงานและบทบาททางวิชาชีพ

source: Security & Roles
th_th: ความปลอดภัยและบทบาท

source: Sensitive Content Filtering
th_th: การกรองเนื้อหาที่ละเอียดอ่อน

source: User session
th_th: เซสชันผู้ใช้

source: Smart Features
th_th: คุณสมบัติอัจฉริยะ

source: Enable talent review
th_th: เปิดใช้งานการทบทวนศักยภาพบุคลากร

source: Talent Review Settings
th_th: การตั้งค่าการทบทวนศักยภาพบุคลากร

source: Worker & Manager Pages
th_th: หน้าพนักงานและผู้จัดการ

source: This category will serve as the default throughout the application.
th_th: หมวดหมู่นี้จะถูกใช้เป็นค่าเริ่มต้นทั่วทั้งแอปพลิเคชัน

source: Global worker category
th_th: หมวดหมู่พนักงานระดับโลก

source: Create global worker category
th_th: สร้างหมวดหมู่พนักงานระดับโลก

source: Edit global worker category
th_th: แก้ไขหมวดหมู่พนักงานแบบส่วนกลาง

source: Get started by creating it.
th_th: เริ่มต้นได้โดยการสร้างมันขึ้นมา

source: No global worker category yet.
th_th: ยังไม่มีหมวดหมู่พนักงานระดับโลก

source: Define the local worker category that will override the global worker category. The order matters because if a worker is included in multiple configurations, the topmost configuration will be applied.
th_th: กำหนดประเภทพนักงานภายในประเทศที่จะใช้แทนประเภทพนักงานส่วนกลาง ลำดับมีความสำคัญ เพราะหากพนักงานอยู่ในหลายการกำหนดค่า ระบบจะใช้การกำหนดค่าที่อยู่บนสุด

source: Local worker category
th_th: ประเภทพนักงานภายในประเทศ

source: Create local category
th_th: สร้างหมวดหมู่เฉพาะพื้นที่

source: Are you sure you want to delete this local worker category? This action cannot be undone.
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบประเภทพนักงานภายในประเทศนี้ การดำเนินการนี้ไม่สามารถยกเลิกได้

source: Delete local worker category
th_th: ลบประเภทพนักงานภายในประเทศ

source: The local worker category was successfully deleted.
th_th: ลบประเภทพนักงานภายในประเทศเรียบร้อยแล้ว

source: Blank configuration
th_th: การกำหนดค่าว่าง

source: Separator
th_th: ตัวคั่น

source: Total workers
th_th: จำนวนพนักงานทั้งหมด

source: No local worker category
th_th: ไม่มีประเภทพนักงานภายในประเทศ

source: Fields selected: {{count}}
th_th: ฟิลด์ที่เลือก: {{count}}

source: Local category name
th_th: ชื่อหมวดหมู่เฉพาะพื้นที่

source: Populations selected: {{count}}
th_th: กลุ่มพนักงานที่เลือก: {{count}}

source: Selected population
th_th: กลุ่มพนักงานที่เลือก

source: Create local worker category
th_th: สร้างประเภทพนักงานภายในประเทศ

source: Edit local worker category
th_th: แก้ไขประเภทพนักงานภายในประเทศ

source: Provide a name for the category
th_th: ระบุชื่อสำหรับหมวดหมู่

source: This population configuration already exists in a different local worker category.
th_th: การกำหนดค่ากลุ่มพนักงานนี้มีอยู่แล้วในประเภทพนักงานภายในประเทศอื่น

source: Choose a population for this configuration.
th_th: เลือกกลุ่มพนักงานสำหรับการกำหนดค่านี้

source: At least one population must be selected.
th_th: ต้องเลือกกลุ่มพนักงานอย่างน้อยหนึ่งกลุ่ม

source: Worker Category Management
th_th: การจัดการหมวดหมู่พนักงาน

source: Select the field whose values will form part of this worker's category.
th_th: เลือกฟิลด์ที่มีค่าเพื่อใช้เป็นส่วนหนึ่งของหมวดหมู่ของพนักงานคนนี้

source: An entity is required.
th_th: จำเป็นต้องมีเอนทิตีหนึ่งรายการ

source: A field is required.
th_th: จำเป็นต้องกรอกข้อมูลในช่องนี้

source: Fill blank fields value with custom values.
th_th: กรอกค่าที่กำหนดเองลงในช่องว่าง

source: The custom value cannot be longer than 50 characters.
th_th: ค่าที่กำหนดเองต้องมีความยาวไม่เกิน 50 อักขระ

source: A custom value is required when using custom blank values.
th_th: ต้องระบุค่าแบบกำหนดเองเมื่อใช้ค่าว่างแบบกำหนดเอง

source: Fill blank fields value with a [Blank] value.
th_th: เติมค่าในช่องว่างด้วยค่า [ว่าง]

source: Define how blank values should be handled.
th_th: กำหนดวิธีจัดการกับค่าที่ว่างเปล่า

source: Blank values
th_th: ค่าว่าง

source: Skip blank fields.
th_th: ข้ามช่องว่างที่เว้นไว้

source: You must add at least one concatenated field.
th_th: คุณต้องเพิ่มฟิลด์ที่เชื่อมต่อกันอย่างน้อยหนึ่งฟิลด์

source: The blank value behavior is required.
th_th: จำเป็นต้องระบุวิธีจัดการค่าที่ว่างเปล่า

source: The separator is required.
th_th: จำเป็นต้องมีตัวคั่น

source: You have not added any fields yet.
th_th: คุณยังไม่ได้เพิ่มฟิลด์ใด ๆ เลย

source: Preview (blank):
th_th: ดูตัวอย่าง (ว่างเปล่า):

source: [Blank]
th_th: [เว้นว่าง]

source: Preview (default):
th_th: ตัวอย่าง (ค่าเริ่มต้น):

source: Complete the configuration to see the preview of category of worker.
th_th: กำหนดค่าจนเสร็จสิ้นเพื่อดูตัวอย่างหมวดหมู่ของคนทำงาน

source: Example of a configuration tailored to the specific use case.
th_th: ตัวอย่างการกำหนดค่าที่ปรับให้เหมาะกับกรณีการใช้งานเฉพาะ

source: • (bullet)
th_th: • (สัญลักษณ์หัวข้อย่อย)

source: : (colon)
th_th: : (โคลอน)

source: , (comma)
th_th: , (เครื่องหมายจุลภาค)

source: - (dash)
th_th: - (ยัติภังค์)

source: / (forward slash)
th_th: / (เครื่องหมายทับ)

source: – (hyphen)
th_th: – (ยัติภังค์)

source: Select the separator you want to use for the configuration.
th_th: เลือกตัวคั่นที่คุณต้องการใช้สำหรับการกำหนดค่า

source: ; (semicolon)
th_th: ; (อัฒภาค)

source: _ (underscore)
th_th: _ (ขีดล่าง)

source: | (vertical bar)
th_th: | (เครื่องหมายทับตั้งหรือเวอร์ติเคิลบาร์)
